const qnaList = [
  {
    q: '1. 꿀강 vs 명강',
    a: [ 
      { answer: '강의의 질 보다는 학점이 중요해!', keyword: ["꿀강", "학점"] },
      { answer: '조금 힘들더라도 좋은 강의를 듣고 싶어!', type: [0, 3, 6, 5, 10, 8] },
    ]
  },
  {
    q: '2. 팀플 유무 ',
    a: [
      { answer: '죽어도 팀플은 피하겠어!', type: [0, 3, 2, 8] },
      { answer: '백지장도 맞들면 낫겠지..', type: [1, 6, 5, 10] },
    ]
  },
  {
    q: '3. 출석점수 유무',
    a: [
      { answer: '출석점수라도 따야지!', type: [1, 3, 2, 10, 8] },
      { answer: '세번까지는 빠질 수도 있지..', type: [7, 9, 11] },
    ]
  },
  {
    q: '4. 과제량',
    a: [
      { answer: '과제가 많을수록 학점을 뒤집을 기회도 많은거지~', type: [1, 2, 4 ] },
      { answer: '시험 한번에 결정되는게 맘이 편해!', type: [7, 10, 8, 9, 11 ] },
    ]
  },
  {
    q: '5. 대체과제 vs 정기고사',
    a: [
      { answer: '마지막에 마지막까지 검토할 수 있는 대체과제가 좋아!', type: [1, 7, 10, 4, 9 ] },
      { answer: '내면 끝이지! 정기고사가 좋아!', type: [0, 3, 6, 11]},
    ]
  },

  {
    q: '6. 시험 난이도',
    a: [
      { answer: '어려워야 변별력이 생기지!', type: [4, 9, 11 ] },
      { answer: '모두가 높은 점수를 받을 수 있는 쉬운 시험이 좋아!', type: [0, 3, 6, 10 ] },
    ]
  },
  {
    q: '7. 타임 어택',
    a: [
      { answer: '40문제를 40분에! 생각할 시간따위 없다!', type: [1, 7, 11 ] },
      { answer: '3문제를 60분에! 시간은 많은데 하나도 모르겠다..', type: [2, 4, 9 ] },
    ]
  },
  {
    q: '8. 강의력',
    a: [
      { answer: '혼자 공부하고 학점만 따면 돼!', type: [0, 4, 9 ] },
      { answer: '교수님의 강의력이 중요해!', type: [3, 2, 6, 5, 10, 8 ] },
    ]
  },
  {
    q: '9. 교수님의 관심도',
    a: [
      { answer: '교수님이 내 이름을 안다고..?', type: [7, 0, 5, 9 ] },
      { answer: '교수님이 관심좀 가져주셨으면 좋겠다..', type: [1, 3, 6, 11 ] },
    ]
  }
]

