const qnaList = [
  {
    q: '1. 꿀강 vs 명강',
    a: [ 
      { answer: '강의의 질 보다는 학점이 중요해!', type: ['꿀강', '학점 잘', '꿀'] },
      { answer: '조금 힘들더라도 좋은 강의를 듣고 싶어!', type: ['명강', '빡센', '어려운데', '재밌는'] },
    ]
  },
  {
    q: '2. 팀플 유무 ',
    a: [
      { answer: '죽어도 팀플은 피하겠어!', type: [] },
      { answer: '백지장도 맞들면 낫겠지..', type: ['팀플', '조별과제', '조별'] },
    ]
  },
  {
    q: '3. 출석점수 유무',
    a: [
      { answer: '출석점수라도 따야지!', type: ['출결', '깐깐하시고'] },
      { answer: '세번까지는 빠질 수도 있지..', type: [ ] },
    ]
  },
  {
    q: '4. 과제량',
    a: [
      { answer: '과제가 많을수록 학점을 뒤집을 기회도 많은거지~', type: ['귀찮았는데', '귀찮을' ] },
      { answer: '시험 한번에 결정되는게 맘이 편해!', type: ['과제없고' ] },
    ]
  },
  {
    q: '5. 대체과제 vs 정기고사',
    a: [
      { answer: '마지막에 마지막까지 검토할 수 있는 대체과제가 좋아!', type: ['레포트', '대체' ] },
      { answer: '내면 끝이지! 정기고사가 좋아!', type: ['두번', '과제없고']},
    ]
  },

  {
    q: '6. 시험 난이도',
    a: [
      { answer: '어려워야 변별력이 생기지!', type: ['깐깐하시고', '깐깐하기', '깐깐하셔서', '깐깐해요'] },
      { answer: '모두가 높은 점수를 받을 수 있는 쉬운 시험이 좋아!', type: ['쉬워서', '쉬운', '쉬웠어요' ] },
    ]
  },
  {
    q: '7. 타임 어택',
    a: [
      { answer: '40문제를 40분에! 생각할 시간따위 없다!', type: ['단', '답', '형'] },
      { answer: '3문제를 60분에! 시간은 많은데 하나도 모르겠다..', type: ['서술' ] },
    ]
  },
  {
    q: '8. 강의력',
    a: [
      { answer: '혼자 공부하고 학점만 따면 돼!', type: ['력', '안', '최악', '별로' ] },
      { answer: '교수님의 강의력이 중요해!', type: ['설명', '력' ] },
    ]
  },
  {
    q: '9. 교수님의 관심도',
    a: [
      { answer: '교수님이 내 이름을 안다고..?', type: ['친절', '열정', '애정', '존중' ] },
      { answer: '교수님이 관심좀 가져주셨으면 좋겠다..', type: [ ] },
    ]
  }
]

