const qnaList = [
  {
    q: '1. 꿀강 VS 명강, 당신의 선택은?',
    a: [ 
      { answer: '꿀강! 강의의 질보다는 학점이 중요해', type: ['꿀강', '학점 잘', '꿀'] },
      { answer: '명강! 조금 힘들더라도 좋은 강의를 듣고 싶어', type: ['명강', '빡센', '어려운데', '재밌는'] },
    ]
  },
  {
    q: '2. 팀플 과제를 선호하시나요?',
    a: [
      { answer: '싫어! 죽어도 팀플은 피하겠어', type: [] },
      { answer: '좋아! 백지장도 맞들면 낫겠지..', type: ['팀플', '조별과제', '조별'] },
    ]
  },
  {
    q: '3. 대망의 OT 시간.. 칼같이 출석체크 하겠다는 교수님의 말씀을 들은 당신은?',
    a: [
      { answer: '좋아! 출석점수라도 따야지!', type: ['출결', '깐깐하시고'] },
      { answer: '도망가자..', type: [ ] },
    ]
  },
  {
    q: '4. 스마트클래스에서 새로운 과제 등록 알림이 끊임없이 울린다면..?',
    a: [
      { answer: '좋아! 과제가 많을수록 학점을 뒤집을 기회도 많은거지~', type: ['귀찮았는데', '귀찮을' ] },
      { answer: '싫어! 시험 한방에 결정나는게 맘이 편해!', type: ['과제없고' ] },
    ]
  },
  {
    q: '5. 정기고사 VS 대체과제, 당신의 선택은?',
    a: [
      { answer: '내면 끝이지! 정기고사가 좋아!', type: ['두번', '과제없고']},
      { answer: '며칠 내내 고민해보고 검토할 수 있는 대체과제가 좋아!', type: ['레포트', '대체' ] },
    ]
  },

  {
    q: '6. 시험 난이도 어려움 VS 쉬움',
    a: [
      { answer: '어려워야 변별력이 생기지!', type: ['깐깐하시고', '깐깐하기', '깐깐하셔서', '깐깐해요'] },
      { answer: '모두가 높은 점수를 받을 수 있는 쉬운 시험이 좋아!', type: ['쉬워서', '쉬운', '쉬웠어요' ] },
    ]
  },
  {
    q: '7. 시험 공지가 내려왔다. 이번 시험 출제 유형은..',
    a: [
      { answer: '단답형 40문제를 40분 안에 푸시오.. 짜릿한 타임어택!', type: ['단', '답', '형'] },
      { answer: '서술형 2문제를 60분동안 작성하시오.. 내 생각을 뽐낼 기회!', type: ['서술' ] },
    ]
  },
  {
    q: '8. 교수님의 세세한 설명 없인 안되는 과목 VS 독학으로도 충분한 과목',
    a: [
      { answer: '교수님의 강의력이 중요해!', type: ['설명', '력' ] },
      { answer: '혼자 공부하고 학점만 따면 돼!', type: ['력', '안', '최악', '별로' ] },
    ]
  },
  {
    q: '9. 따뜻한 교수님 VS 냉철한 교수님',
    a: [
      { answer: '위안과 안정이 필요해..', type: ['친절', '열정', '애정', '존중' ] },
      { answer: '현실적인 조언이 좋아!', type: [ ] },
    ]
  }
]

